{
  "last_node_id": 20,
  "last_link_id": 30,
  "nodes": [
    {
      "id": 5,
      "type": "DownloadAndLoadFlorence2Model",
      "pos": [
        -216,
        217
      ],
      "size": {
        "0": 315,
        "1": 106
      },
      "flags": {},
      "order": 0,
      "mode": 0,
      "inputs": [
        {
          "name": "lora",
          "type": "PEFTLORA",
          "link": null
        }
      ],
      "outputs": [
        {
          "name": "florence2_model",
          "type": "FL2MODEL",
          "links": [
            4
          ],
          "shape": 3
        }
      ],
      "properties": {
        "Node name for S&R": "DownloadAndLoadFlorence2Model"
      },
      "widgets_values": [
        "microsoft/Florence-2-base-ft",
        "fp16",
        "sdpa"
      ]
    },
    {
      "id": 17,
      "type": "IF_DisplayText",
      "pos": [
        1008,
        468
      ],
      "size": {
        "0": 350.7435302734375,
        "1": 226.0487823486328
      },
      "flags": {},
      "order": 5,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 20,
          "widget": {
            "name": "text"
          }
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "type": "STRING",
          "links": [
            21
          ],
          "shape": 3,
          "slot_index": 0
        }
      ],
      "properties": {
        "Node name for S&R": "IF_DisplayText"
      },
      "widgets_values": [
        "",
        "A woman is standing on the beach. She is wearing a blue bikini top and a blue and white skirt. The woman has long blonde hair. The water is blue. There are small waves in the water. A woman is standing on the beach. She is wearing a white tank top and a pair of blue shorts. The sand is beige in color. The water is blue with white waves in it. Part of a rock can be seen in the water. The woman has long blonde hair. The sky is blue. A woman is standing outside on a sunny day. She has long blonde hair. She is wearing a black and white bikini top. There is water behind her. A woman is standing in front of a white wall. She is wearing a black and white top and blue pants. The woman has long blonde hair. A woman is smiling at the camera. She has long blonde hair. She is wearing a light blue top. She also has on a pair of blue shorts with white stripes. A woman is standing on the beach. She is wearing a blue and white tank top and blue shorts. The woman has long blonde hair and is smiling. There is water behind the woman. A woman is standing in front of a white wall. She is wearing a blue and white bikini top and shorts. The woman has long blonde hair and is smiling. A woman is sitting on top of a bike. She is wearing a blue tank top and white shorts. She has blonde hair and is smiling. There is water behind her. A woman with long blonde hair is smiling. She is wearing a two piece bathing suit. The bathing suit is light blue with white dots. The woman is sitting against a white wall. A woman is standing in front of a white wall. She is wearing a blue tank top and black and white shorts. The woman has blonde hair and is smiling. A woman is standing in front of a white wall. She is wearing a white and blue tank top and blue shorts. The woman has long blonde hair and is smiling. A woman is standing in front of a white wall. She is wearing a blue tank top. There is a blue door behind her. A woman is standing on the street. She is wearing a blue tank top and black and white shorts. She has white shoes on her feet. There is a building behind her. A woman is standing in front of a white wall. She is wearing a blue and white bikini top and blue shorts. The woman has long blonde hair and is smiling. A woman is standing in front of a blue wall. She is wearing a blue and white bikini top. She has blonde hair and is smiling. A woman is standing outside on a sunny day. She has long blonde hair. She is wearing a blue and white sports bra and blue shorts. The woman is holding onto a blue bicycle. A woman is standing in front of the ocean. She is wearing a blue tank top and a white skirt with black dots on it. The woman has blonde hair and is smiling. A woman is standing in front of a green wall. She is wearing a blue top and blue shorts. The woman has blonde hair and is smiling at the camera. There is a bike behind the woman. A woman is standing in front of a white wall. She is wearing a blue bikini top and blue and white bottoms. She has a bracelet on her wrist. A woman is standing on the beach. She is wearing a blue bikini top and a blue and white skirt. The woman has long blonde hair. The water is blue. There are small waves in the water. A woman is standing in front of a blue wall. She is wearing a blue tank top and a white skirt with black dots on it. The woman has long blonde hair. A woman is sitting on the beach. She is wearing a blue one piece swimsuit. She has blonde hair and is smiling. Behind her is the ocean. A woman is standing in front of a blue wall. She is wearing a sleeveless top that has small white dots on it. The woman has long blonde hair and is smiling. A woman is standing in front of a white wall. She is wearing a blue and white bikini top. She has long blonde hair and is smiling. A woman is standing in front of a blue wall. She is wearing a blue tank top. She has long blonde hair and is smiling. A woman is standing in front of a blue wall. She is wearing a blue top and a black and white skirt. The woman has long blonde hair. A woman is standing against a light blue wall. She is wearing a blue tank top and a white skirt with blue stripes on it. A woman is sitting on the sand of a beach. She is wearing a blue sleeveless dress with white dots on it. The woman has long blonde hair that is blowing in the wind. The water behind the woman is blue and calm. There are small waves in the water. A woman is standing in front of a white wall. She has long blonde hair. She is wearing a blue and white tank top and a blue skirt. A woman is standing in front of a gray wall. She is wearing a blue and white bra. The woman has long blonde hair."
      ]
    },
    {
      "id": 9,
      "type": "Save Text File",
      "pos": [
        992,
        813
      ],
      "size": {
        "0": 422.1818542480469,
        "1": 199.73536682128906
      },
      "flags": {},
      "order": 7,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 21,
          "widget": {
            "name": "text"
          }
        },
        {
          "name": "filename_prefix",
          "type": "STRING",
          "link": 14,
          "widget": {
            "name": "filename_prefix"
          }
        }
      ],
      "properties": {
        "Node name for S&R": "Save Text File"
      },
      "widgets_values": [
        "",
        "./ComfyUI/output/[time(%Y-%m-%d)]",
        "ComfyUI",
        "_",
        0,
        ".txt",
        "utf-8"
      ]
    },
    {
      "id": 20,
      "type": "PreviewImage",
      "pos": [
        1051,
        87
      ],
      "size": {
        "0": 210,
        "1": 246
      },
      "flags": {},
      "order": 4,
      "mode": 0,
      "inputs": [
        {
          "name": "images",
          "type": "IMAGE",
          "link": 27
        }
      ],
      "properties": {
        "Node name for S&R": "PreviewImage"
      }
    },
    {
      "id": 6,
      "type": "LoadImageListFromDir //Inspire",
      "pos": [
        -224,
        460
      ],
      "size": {
        "0": 315,
        "1": 150
      },
      "flags": {},
      "order": 1,
      "mode": 0,
      "outputs": [
        {
          "name": "IMAGE",
          "type": "IMAGE",
          "links": [
            9,
            12
          ],
          "shape": 6,
          "slot_index": 0
        },
        {
          "name": "MASK",
          "type": "MASK",
          "links": null,
          "shape": 6
        }
      ],
      "properties": {
        "Node name for S&R": "LoadImageListFromDir //Inspire"
      },
      "widgets_values": [
        "C:\\Users\\Ben\\Desktop\\character_Allison\\images",
        0,
        0,
        false
      ]
    },
    {
      "id": 1,
      "type": "Florence2Run",
      "pos": [
        298,
        199
      ],
      "size": {
        "0": 400,
        "1": 352
      },
      "flags": {},
      "order": 2,
      "mode": 0,
      "inputs": [
        {
          "name": "image",
          "type": "IMAGE",
          "link": 9
        },
        {
          "name": "florence2_model",
          "type": "FL2MODEL",
          "link": 4,
          "slot_index": 1
        }
      ],
      "outputs": [
        {
          "name": "image",
          "type": "IMAGE",
          "links": [
            27
          ],
          "shape": 3,
          "slot_index": 0
        },
        {
          "name": "mask",
          "type": "MASK",
          "links": null,
          "shape": 3
        },
        {
          "name": "caption",
          "type": "STRING",
          "links": [
            20
          ],
          "shape": 3,
          "slot_index": 2
        },
        {
          "name": "data",
          "type": "JSON",
          "links": null,
          "shape": 3
        }
      ],
      "properties": {
        "Node name for S&R": "Florence2Run"
      },
      "widgets_values": [
        "",
        "more_detailed_caption",
        true,
        false,
        1024,
        3,
        true,
        "",
        562000612712731,
        "randomize"
      ]
    },
    {
      "id": 13,
      "type": "CR Integer To String",
      "pos": [
        383,
        739
      ],
      "size": {
        "0": 315,
        "1": 78
      },
      "flags": {},
      "order": 6,
      "mode": 0,
      "inputs": [
        {
          "name": "int_",
          "type": "INT",
          "link": 13,
          "widget": {
            "name": "int_"
          }
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "type": "STRING",
          "links": [
            14
          ],
          "shape": 3,
          "slot_index": 0
        },
        {
          "name": "show_help",
          "type": "STRING",
          "links": null,
          "shape": 3
        }
      ],
      "properties": {
        "Node name for S&R": "CR Integer To String"
      },
      "widgets_values": [
        0
      ]
    },
    {
      "id": 12,
      "type": "ListCounter //Inspire",
      "pos": [
        -43,
        746
      ],
      "size": {
        "0": 315,
        "1": 58
      },
      "flags": {},
      "order": 3,
      "mode": 0,
      "inputs": [
        {
          "name": "signal",
          "type": "*",
          "link": 12
        }
      ],
      "outputs": [
        {
          "name": "INT",
          "type": "INT",
          "links": [
            13
          ],
          "shape": 3,
          "slot_index": 0
        }
      ],
      "properties": {
        "Node name for S&R": "ListCounter //Inspire"
      },
      "widgets_values": [
        0
      ]
    }
  ],
  "links": [
    [
      4,
      5,
      0,
      1,
      1,
      "FL2MODEL"
    ],
    [
      9,
      6,
      0,
      1,
      0,
      "IMAGE"
    ],
    [
      12,
      6,
      0,
      12,
      0,
      "*"
    ],
    [
      13,
      12,
      0,
      13,
      0,
      "INT"
    ],
    [
      14,
      13,
      0,
      9,
      1,
      "STRING"
    ],
    [
      20,
      1,
      2,
      17,
      0,
      "STRING"
    ],
    [
      21,
      17,
      0,
      9,
      0,
      "STRING"
    ],
    [
      27,
      1,
      0,
      20,
      0,
      "IMAGE"
    ]
  ],
  "groups": [],
  "config": {},
  "extra": {
    "ds": {
      "scale": 0.6830134553650705,
      "offset": [
        354.3227264897729,
        294.12792898306276
      ]
    }
  },
  "version": 0.4
}